app/controllers/question_tree_controller.rb

  def index
    id = params[:id] ? params[:id].to_i : Question.roots.first
    @question = Question.find(id)
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1)

  def next
    resp = Response.find(params[:response_id])
---
SELECT * FROM "responses" WHERE ("responses".question_id = 10)